[
    {
        "title": "Quick Chicken Tikka Masala",
        "category": "Mains", 
        "ingredients": "1 (2 1/2in) piece ginger (peeled), 4 garlic cloves, 1/2 medium yellow onion, 1 1/2 pounds boneless skinless chicken breasts (about 3 breasts, cut into 1in cubes), 2 teaspoons kosher salt (divided), 3/4 teaspoon freshly ground black pepper (divided), 2 1/2 teaspoons garam masala (divided), 2 tablespoons vegetable oil, 2 tablespoons unsalted butter, 1 tablespoon tomato paste, 1 1/2 teaspoons turmeric, 1/8-1/4 teaspoon cayenne pepper, 1 (28-ounce) can crushed tomatoes, 1 (10-ounce) package frozen peas (thawed), 1/2 cup plain full-fat or low-fat yogurt (Greek or regular), 1 tablespoon fresh lemon juice, 1/4 cup fresh cilantro, Naan (Indian flatbread; for serving)",
        "instructions": "Pulse ginger and garlic in a food processor until finely chopped. Add onion and pulse again until finely chopped. Toss chicken with 1 1/2 tsp. salt, 1/2 tsp. pepper, and 1 tsp. garam masala in a medium bowl. Heat oil over high in a large skillet (at least 12 inches in diameter). Add chicken and cook, tossing occasionally, until lightly browned and cooked through, about 5 minutes. Transfer chicken to a clean medium bowl. Heat same skillet over medium-high and add butter, chopped onion mixture, 1/2 tsp. salt, and 1/4 tsp. pepper. Cook, stirring occasionally, until onion is softened and translucent, about 3 minutes. Add tomato paste, turmeric, cayenne, and remaining 1 1/2 tsp. garam masala and cook, stirring constantly, about 30 seconds. Add tomatoes and cook, stirring occasionally, until hot, about 2 minutes. Return chicken to pan, add peas, and cook, stirring occasionally, until warmed through, about 1 minute more. Remove from heat and stir in yogurt and lemon juice. Season with salt and pepper. Divide among 4 plates, top with cilantro, and serve with naan.",
        "favorite": false
    },
    {
        "title": "Sweet Potato and Black Bean Enchilada Skillet",
        "category": "Mains",
        "ingredients": "2 teaspoons olive oil, 3 cups 1/2-inch diced and peeled sweet potato, salt and pepper (to season), 1 medium yellow onion (diced), 3 cloves of garlic (minced), 1/2 jalapeno (seeded and diced), 1 teaspoon cumin, 1 teaspoon chili powder, 1 15 ounce can black beans (rinsed and drained), 8 yellow corn tortillas (cut into thick strips), 1 15 ounce can red enchilada sauce, 1 cup colby jack or mexican cheese (divided), cilantro and sour cream (optional for serving)",
        "instructions": "Heat olive oil over medium-high heat in large oven-proof skillet. Add onions, garlic, and jalapeno and cook 2-3 minutes until onions become translucent and garlic is fragrant. Add cubed sweet potatoes, cumin, and chili powder and season with salt and pepper. Cook, stirring occasionally, until the potatoes are slightly tender, 10-13 minutes. You want the potatoes to be fork tender, but not so tender that it starts to fall apart and become mush. Next add the black beans, corn tortilla pieces, and can of enchilada sauce and stir to combine. Reduce heat to medium-low and sprinkle in 1/2 cup of cheese. Stir again and simmer for a few minutes. Turn on your oven broiler to high. Sprinkle an additional 1/2 cup of cheese over the top of the enchilada mixture and place in oven under broiler for 3-5 minutes until cheese melts and tortilla edges become a tiny golden brown. Remove from heat and serve immediately. Feel free to add in cilantro. Serve with sour cream, guacamole, or hot sauce! Enjoy!",
        "favorite": false
    },
    {
        "title": "Corn, Cheddar, and Scallion Strata",
        "category": "Breakfast/Brunch",
        "ingredients": "1 tablespoon butter, 3 cups fresh corn (cut from 3 small-to-average cobs), 1 1/2 cup thinly sliced scallions (both white and green parts from a 4-ounce bundle), 8 cups whole wheat/country/French bread in 1-inch cubes (weight will vary from 10 to 14 ounces, depending on bread type), 2 cups (6 ounces) coarsely grated sharp cheddar, 1 cup (2 ounces) finely grated parmesan, 9 large eggs, 2 tablespoons mayonnaise (optional, can omit or replace with Dijon), 2 3/4 cups milk, 1 teaspoon table salt or 2 teaspoons of a coarse sea salt, Freshly ground black pepper",
        "instructions": "Generously butter a 3-quart baking dish (a lasagna or 9×13-inch pan works well here too). Toss corn and scallions together in a medium bowl. Combine cheeses in another bowl. In a large bowl, gently beat eggs and mayo together, then whisk in milk, salt and lots (or, if measuring, 1/2 teaspoon) of freshly ground black pepper. Spread one-third of bread cubes in prepared baking dish — it will not fully cover bottom of dish; this is fine. Add one-third of corn, then cheese mixture. Repeat layering twice with remaining bread, corn and cheese. Pour egg mixture evenly over strata. Cover with plastic wrap and refrigerate for at least 8 hours or up to 1 day. When ready to bake, heat oven to 350 degrees F. Bake strata, uncovered, until puffed, golden brown and cooked through, about 45 to 55 minutes. Let stand 5 minutes before serving. Do ahead: Strata keeps baked in the fridge for 4 days or longer in the freezer, wrapped well. It reheats wonderfully, either from the fridge or freezer and holds up well in lunch boxes.",
        "favorite": false
    },
    {
        "title": "Ginger and Tumeric Energy Bites",
        "category": "Other",
        "ingredients": "3/4 cup dark chocolate-covered espresso beans (optional), 1/2 cup unsweetened coconut flakes, 1/2 cup raw almonds, 1/2 cup raw pumpkin seeds (pepitas), 1 1/2 cups pitted dates (preferably Medjool), 1/4 cup chia seeds, 1/2 cup creamy almond butter, 1 teaspoon ground ginger, 1 teaspoon ground turmeric, 1/2 teaspoon kosher salt",
        "instructions": "If using, pulse espresso beans in a food processor until very finely ground. Transfer to a rimmed baking sheet or plate; set aside. Pulse coconut, almonds, and pumpkin seeds in food processor until very coarsely chopped. Transfer to a medium bowl. Pulse dates in food processor until finely chopped. Scrape down sides of bowl and add chia seeds. With the motor running, slowly stream in 1/4 cup very hot water and process until a paste forms. Add almond butter, ginger, turmeric, and salt; process until very smooth. Add coconut mixture and pulse until just combined. Scoop date mixture by the level tablespoon, roll into balls in between palms, then roll in reserved chopped espresso beans, pressing slightly to adhere. Transfer to a rimmed baking sheet or plate and chill at least 1 hour. Do Ahead: Bites can be made 7 days ahead. Chill in an airtight container, or freeze up to 3 months.",
        "favorite": false
    }
]